{
  "gsd": {
    "metadata": {
      "exploitCode": "unknown",
      "remediation": "unknown",
      "reportConfidence": "confirmed",
      "type": "vulnerability"
    },
    "osvSchema": {
      "aliases": [
        "CVE-2024-26646"
      ],
      "id": "GSD-2024-26646",
      "modified": "2024-02-20T06:02:29.229188Z",
      "schema_version": "1.4.0"
    }
  },
  "namespaces": {
    "cve.org": {
      "CVE_data_meta": {
        "ASSIGNER": "cve@mitre.org",
        "ID": "CVE-2024-26646",
        "STATE": "RESERVED"
      },
      "data_format": "MITRE",
      "data_type": "CVE",
      "data_version": "4.0",
      "description": {
        "description_data": [
          {
            "lang": "eng",
            "value": "** RESERVED ** This candidate has been reserved by an organization or individual that will use it when announcing a new security problem. When the candidate has been publicized, the details for this candidate will be provided."
          }
        ]
      }
    },
    "nvd.nist.gov": {
      "cve": {
        "descriptions": [
          {
            "lang": "en",
            "value": "In the Linux kernel, the following vulnerability has been resolved:\n\nthermal: intel: hfi: Add syscore callbacks for system-wide PM\n\nThe kernel allocates a memory buffer and provides its location to the\nhardware, which uses it to update the HFI table. This allocation occurs\nduring boot and remains constant throughout runtime.\n\nWhen resuming from hibernation, the restore kernel allocates a second\nmemory buffer and reprograms the HFI hardware with the new location as\npart of a normal boot. The location of the second memory buffer may\ndiffer from the one allocated by the image kernel.\n\nWhen the restore kernel transfers control to the image kernel, its HFI\nbuffer becomes invalid, potentially leading to memory corruption if the\nhardware writes to it (the hardware continues to use the buffer from the\nrestore kernel).\n\nIt is also possible that the hardware \"forgets\" the address of the memory\nbuffer when resuming from \"deep\" suspend. Memory corruption may also occur\nin such a scenario.\n\nTo prevent the described memory corruption, disable HFI when preparing to\nsuspend or hibernate. Enable it when resuming.\n\nAdd syscore callbacks to handle the package of the boot CPU (packages of\nnon-boot CPUs are handled via CPU offline). Syscore ops always run on the\nboot CPU. Additionally, HFI only needs to be disabled during \"deep\" suspend\nand hibernation. Syscore ops only run in these cases.\n\n[ rjw: Comment adjustment, subject and changelog edits ]"
          },
          {
            "lang": "es",
            "value": "En el kernel de Linux, se resolvió la siguiente vulnerabilidad: térmica: intel: hfi: agregar devoluciones de llamada de syscore para PM en todo el sistema El kernel asigna un búfer de memoria y proporciona su ubicación al hardware, que lo utiliza para actualizar la tabla HFI. Esta asignación ocurre durante el arranque y permanece constante durante el tiempo de ejecución. Al salir de la hibernación, el kernel de restauración asigna un segundo búfer de memoria y reprograma el hardware HFI con la nueva ubicación como parte de un inicio normal. La ubicación del segundo búfer de memoria puede diferir de la asignada por el núcleo de la imagen. Cuando el kernel de restauración transfiere el control al kernel de imagen, su búfer HFI deja de ser válido, lo que puede provocar daños en la memoria si el hardware escribe en él (el hardware continúa usando el búfer del kernel de restauración). También es posible que el hardware \"olvide\" la dirección del búfer de memoria al reanudar desde una suspensión \"profunda\". En tal escenario también puede ocurrir corrupción de memoria. Para evitar la corrupción de memoria descrita, desactive HFI cuando se prepare para suspender o hibernar. Habilítelo al reanudar. Agregue devoluciones de llamada de syscore para manejar el paquete de la CPU de arranque (los paquetes de CPU que no son de arranque se manejan a través de la CPU sin conexión). Las operaciones de Syscore siempre se ejecutan en la CPU de arranque. Además, HFI solo necesita desactivarse durante la suspensión e hibernación \"profundas\". Las operaciones de Syscore solo se ejecutan en estos casos. [rjw: ajuste de comentarios, ediciones de asunto y registro de cambios]"
          }
        ],
        "id": "CVE-2024-26646",
        "lastModified": "2024-03-27T12:29:41.530",
        "metrics": {},
        "published": "2024-03-26T18:15:09.910",
        "references": [
          {
            "source": "416baaa9-dc9f-4396-8d5f-8c081fb06d67",
            "url": "https://git.kernel.org/stable/c/019ccc66d56a696a4dfee3bfa2f04d0a7c3d89ee"
          },
          {
            "source": "416baaa9-dc9f-4396-8d5f-8c081fb06d67",
            "url": "https://git.kernel.org/stable/c/28f010dc50df0f7987c04112114fcfa7e0803566"
          },
          {
            "source": "416baaa9-dc9f-4396-8d5f-8c081fb06d67",
            "url": "https://git.kernel.org/stable/c/97566d09fd02d2ab329774bb89a2cdf2267e86d9"
          },
          {
            "source": "416baaa9-dc9f-4396-8d5f-8c081fb06d67",
            "url": "https://git.kernel.org/stable/c/c9d6d63b6c03afaa6f185df249af693a7939577c"
          }
        ],
        "sourceIdentifier": "416baaa9-dc9f-4396-8d5f-8c081fb06d67",
        "vulnStatus": "Awaiting Analysis"
      }
    }
  }
}