{
  "gsd": {
    "metadata": {
      "exploitCode": "unknown",
      "remediation": "unknown",
      "reportConfidence": "confirmed",
      "type": "vulnerability"
    },
    "osvSchema": {
      "aliases": [
        "CVE-2024-2511"
      ],
      "id": "GSD-2024-2511",
      "modified": "2024-04-02T05:02:53.431059Z",
      "schema_version": "1.4.0"
    }
  },
  "namespaces": {
    "cve.org": {
      "CVE_data_meta": {
        "ASSIGNER": "cve@mitre.org",
        "ID": "CVE-2024-2511",
        "STATE": "RESERVED"
      },
      "data_format": "MITRE",
      "data_type": "CVE",
      "data_version": "4.0",
      "description": {
        "description_data": [
          {
            "lang": "eng",
            "value": "** RESERVED ** This candidate has been reserved by an organization or individual that will use it when announcing a new security problem. When the candidate has been publicized, the details for this candidate will be provided."
          }
        ]
      }
    },
    "nvd.nist.gov": {
      "cve": {
        "descriptions": [
          {
            "lang": "en",
            "value": "Issue summary: Some non-default TLS server configurations can cause unbounded\nmemory growth when processing TLSv1.3 sessions\n\nImpact summary: An attacker may exploit certain server configurations to trigger\nunbounded memory growth that would lead to a Denial of Service\n\nThis problem can occur in TLSv1.3 if the non-default SSL_OP_NO_TICKET option is\nbeing used (but not if early_data support is also configured and the default\nanti-replay protection is in use). In this case, under certain conditions, the\nsession cache can get into an incorrect state and it will fail to flush properly\nas it fills. The session cache will continue to grow in an unbounded manner. A\nmalicious client could deliberately create the scenario for this failure to\nforce a Denial of Service. It may also happen by accident in normal operation.\n\nThis issue only affects TLS servers supporting TLSv1.3. It does not affect TLS\nclients.\n\nThe FIPS modules in 3.2, 3.1 and 3.0 are not affected by this issue. OpenSSL\n1.0.2 is also not affected by this issue."
          },
          {
            "lang": "es",
            "value": "Resumen del problema: algunas configuraciones de servidor TLS no predeterminadas pueden causar un crecimiento ilimitado de la memoria al procesar sesiones TLSv1.3. Resumen de impacto: un atacante puede explotar ciertas configuraciones del servidor para desencadenar un crecimiento ilimitado de la memoria que conduciría a una denegación de servicio. Este problema puede ocurrir en TLSv1.3 si se utiliza la opción SSL_OP_NO_TICKET no predeterminada (pero no si también se configura la compatibilidad con early_data y se utiliza la protección antirrepetición predeterminada). En este caso, bajo ciertas condiciones, el caché de la sesión puede entrar en un estado incorrecto y no se vaciará correctamente a medida que se llena. La caché de la sesión seguirá creciendo de forma ilimitada. Un cliente malintencionado podría crear deliberadamente el escenario para que este fallo fuerce una denegación de servicio. También puede ocurrir por accidente durante el funcionamiento normal. Este problema solo afecta a los servidores TLS que admiten TLSv1.3. No afecta a los clientes TLS. Los módulos FIPS en 3.2, 3.1 y 3.0 no se ven afectados por este problema. OpenSSL 1.0.2 tampoco se ve afectado por este problema."
          }
        ],
        "id": "CVE-2024-2511",
        "lastModified": "2024-04-08T18:48:40.217",
        "metrics": {},
        "published": "2024-04-08T14:15:07.660",
        "references": [
          {
            "source": "openssl-security@openssl.org",
            "url": "https://github.com/openssl/openssl/commit/7e4d731b1c07201ad9374c1cd9ac5263bdf35bce"
          },
          {
            "source": "openssl-security@openssl.org",
            "url": "https://github.com/openssl/openssl/commit/b52867a9f618bb955bed2a3ce3db4d4f97ed8e5d"
          },
          {
            "source": "openssl-security@openssl.org",
            "url": "https://github.com/openssl/openssl/commit/e9d7083e241670332e0443da0f0d4ffb52829f08"
          },
          {
            "source": "openssl-security@openssl.org",
            "url": "https://github.openssl.org/openssl/extended-releases/commit/5f8d25770ae6437db119dfc951e207271a326640"
          },
          {
            "source": "openssl-security@openssl.org",
            "url": "https://www.openssl.org/news/secadv/20240408.txt"
          }
        ],
        "sourceIdentifier": "openssl-security@openssl.org",
        "vulnStatus": "Awaiting Analysis"
      }
    }
  }
}