{
  "gsd": {
    "metadata": {
      "exploitCode": "unknown",
      "remediation": "unknown",
      "reportConfidence": "confirmed",
      "type": "vulnerability"
    },
    "osvSchema": {
      "aliases": [
        "CVE-2024-28850"
      ],
      "id": "GSD-2024-28850",
      "modified": "2024-04-02T05:02:55.549616Z",
      "schema_version": "1.4.0"
    }
  },
  "namespaces": {
    "cve.org": {
      "CVE_data_meta": {
        "ASSIGNER": "cve@mitre.org",
        "ID": "CVE-2024-28850",
        "STATE": "RESERVED"
      },
      "data_format": "MITRE",
      "data_type": "CVE",
      "data_version": "4.0",
      "description": {
        "description_data": [
          {
            "lang": "eng",
            "value": "** RESERVED ** This candidate has been reserved by an organization or individual that will use it when announcing a new security problem. When the candidate has been publicized, the details for this candidate will be provided."
          }
        ]
      }
    },
    "nvd.nist.gov": {
      "cve": {
        "descriptions": [
          {
            "lang": "en",
            "value": "WP Crontrol controls the cron events on WordPress websites.  WP Crontrol includes a feature that allows administrative users to create events in the WP-Cron system that store and execute PHP code subject to the restrictive security permissions documented here. While there is no known vulnerability in this feature on its own, there exists potential for this feature to be vulnerable to RCE if it were specifically targeted via vulnerability chaining that exploited a separate SQLi (or similar) vulnerability. This is exploitable on a site if one of the below preconditions are met, the site is vulnerable to a writeable SQLi vulnerability in any plugin, theme, or WordPress core, the site's database is compromised at the hosting level, the site is vulnerable to a method of updating arbitrary options in the wp_options table, or the site is vulnerable to a method of triggering an arbitrary action, filter, or function with control of the parameters.  As a hardening measure, WP Crontrol version 1.16.2 ships with a new feature that prevents tampering of the code stored in a PHP cron event."
          },
          {
            "lang": "es",
            "value": "WP Crontrol controla los eventos cron en los sitios web de WordPress. WP Crontrol incluye una función que permite a los usuarios administrativos crear eventos en el sistema WP-Cron que almacenan y ejecutan código PHP sujeto a los permisos de seguridad restrictivos documentados aquí. Si bien no existe una vulnerabilidad conocida en esta característica por sí sola, existe la posibilidad de que esta característica sea vulnerable a RCE si fuera atacada específicamente a través de un encadenamiento de vulnerabilidades que explotara una vulnerabilidad SQLi (o similar) separada. Esto es explotable en un sitio si se cumple una de las siguientes condiciones previas, el sitio es vulnerable a una vulnerabilidad SQLi grabable en cualquier complemento, tema o núcleo de WordPress, la base de datos del sitio está comprometida a nivel de alojamiento, el sitio es vulnerable a un método para actualizar opciones arbitrarias en la tabla wp_options, o el sitio es vulnerable a un método para activar una acción, filtro o función arbitraria con control de los parámetros. Como medida de refuerzo, la versión 1.16.2 de WP Crontrol viene con una nueva característica que evita la manipulación del código almacenado en un evento cron de PHP."
          }
        ],
        "id": "CVE-2024-28850",
        "lastModified": "2024-03-26T12:55:05.010",
        "metrics": {
          "cvssMetricV31": [
            {
              "cvssData": {
                "attackComplexity": "HIGH",
                "attackVector": "LOCAL",
                "availabilityImpact": "HIGH",
                "baseScore": 8.1,
                "baseSeverity": "HIGH",
                "confidentialityImpact": "HIGH",
                "integrityImpact": "HIGH",
                "privilegesRequired": "NONE",
                "scope": "CHANGED",
                "userInteraction": "NONE",
                "vectorString": "CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H",
                "version": "3.1"
              },
              "exploitabilityScore": 1.4,
              "impactScore": 6.0,
              "source": "security-advisories@github.com",
              "type": "Secondary"
            }
          ]
        },
        "published": "2024-03-25T19:15:58.947",
        "references": [
          {
            "source": "security-advisories@github.com",
            "url": "https://github.com/johnbillion/wp-crontrol/releases/tag/1.16.2"
          },
          {
            "source": "security-advisories@github.com",
            "url": "https://github.com/johnbillion/wp-crontrol/security/advisories/GHSA-9xvf-cjvf-ff5q"
          }
        ],
        "sourceIdentifier": "security-advisories@github.com",
        "vulnStatus": "Awaiting Analysis",
        "weaknesses": [
          {
            "description": [
              {
                "lang": "en",
                "value": "CWE-494"
              }
            ],
            "source": "security-advisories@github.com",
            "type": "Secondary"
          }
        ]
      }
    }
  }
}