{
  "GSD": {
    "alias": "CVE-2023-50726",
    "id": "GSD-2023-50726"
  },
  "gsd": {
    "metadata": {
      "exploitCode": "unknown",
      "remediation": "unknown",
      "reportConfidence": "confirmed",
      "type": "vulnerability"
    },
    "osvSchema": {
      "aliases": [
        "CVE-2023-50726"
      ],
      "id": "GSD-2023-50726",
      "modified": "2023-12-13T01:20:31.276869Z",
      "schema_version": "1.4.0"
    }
  },
  "namespaces": {
    "cve.org": {
      "CVE_data_meta": {
        "ASSIGNER": "cve@mitre.org",
        "ID": "CVE-2023-50726",
        "STATE": "RESERVED"
      },
      "data_format": "MITRE",
      "data_type": "CVE",
      "data_version": "4.0",
      "description": {
        "description_data": [
          {
            "lang": "eng",
            "value": "** RESERVED ** This candidate has been reserved by an organization or individual that will use it when announcing a new security problem. When the candidate has been publicized, the details for this candidate will be provided."
          }
        ]
      }
    },
    "nvd.nist.gov": {
      "cve": {
        "descriptions": [
          {
            "lang": "en",
            "value": "Argo CD is a declarative, GitOps continuous delivery tool for Kubernetes. \"Local sync\" is an Argo CD feature that allows developers to temporarily override an Application's manifests with locally-defined manifests. Use of the feature should generally be limited to highly-trusted users, since it allows the user to bypass any merge protections in git. An improper validation bug allows users who have `create` privileges but not `override` privileges to sync local manifests on app creation. All other restrictions, including AppProject restrictions are still enforced. The only restriction which is not enforced is that the manifests come from some approved git/Helm/OCI source. The bug was introduced in 1.2.0-rc1 when the local manifest sync feature was added. The bug has been patched in Argo CD versions 2.10.3, 2.9.8, and 2.8.12. Users are advised to upgrade. Users unable to upgrade may mitigate the risk of branch protection bypass by removing `applications, create` RBAC access. The only way to eliminate the issue without removing RBAC access is to upgrade to a patched version."
          },
          {
            "lang": "es",
            "value": "Argo CD es una herramienta declarativa de entrega continua de GitOps para Kubernetes. La \"sincronización local\" es una característica de Argo CD que permite a los desarrolladores anular temporalmente los manifiestos de una aplicación con manifiestos definidos localmente. El uso de la función generalmente debe limitarse a usuarios de alta confianza, ya que permite al usuario evitar cualquier protección de combinación en git. Un error de validación inadecuado permite a los usuarios que tienen privilegios de \"crear\" pero no privilegios de \"anular\" sincronizar manifiestos locales al crear la aplicación. Todas las demás restricciones, incluidas las de AppProject, aún se aplican. La única restricción que no se aplica es que los manifiestos provengan de alguna fuente aprobada de git/Helm/OCI. El error se introdujo en 1.2.0-rc1 cuando se agregó la función de sincronización del manifiesto local. El error se ha solucionado en las versiones 2.10.3, 2.9.8 y 2.8.12 de Argo CD. Se recomienda a los usuarios que actualicen. Los usuarios que no puedan actualizar pueden mitigar el riesgo de eludir la protección de sucursal eliminando el acceso RBAC \"aplicaciones, creación\". La única forma de eliminar el problema sin eliminar el acceso a RBAC es actualizar a una versión parcheada."
          }
        ],
        "id": "CVE-2023-50726",
        "lastModified": "2024-03-14T12:52:21.763",
        "metrics": {
          "cvssMetricV31": [
            {
              "cvssData": {
                "attackComplexity": "LOW",
                "attackVector": "NETWORK",
                "availabilityImpact": "LOW",
                "baseScore": 6.4,
                "baseSeverity": "MEDIUM",
                "confidentialityImpact": "NONE",
                "integrityImpact": "LOW",
                "privilegesRequired": "LOW",
                "scope": "CHANGED",
                "userInteraction": "NONE",
                "vectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:N/I:L/A:L",
                "version": "3.1"
              },
              "exploitabilityScore": 3.1,
              "impactScore": 2.7,
              "source": "security-advisories@github.com",
              "type": "Secondary"
            }
          ]
        },
        "published": "2024-03-13T21:15:54.797",
        "references": [
          {
            "source": "security-advisories@github.com",
            "url": "https://argo-cd.readthedocs.io/en/latest/operator-manual/rbac"
          },
          {
            "source": "security-advisories@github.com",
            "url": "https://github.com/argoproj/argo-cd/commit/3b8f673f06c2d228e01cbc830e5cb57cef008978"
          },
          {
            "source": "security-advisories@github.com",
            "url": "https://github.com/argoproj/argo-cd/security/advisories/GHSA-g623-jcgg-mhmm"
          }
        ],
        "sourceIdentifier": "security-advisories@github.com",
        "vulnStatus": "Awaiting Analysis",
        "weaknesses": [
          {
            "description": [
              {
                "lang": "en",
                "value": "CWE-269"
              }
            ],
            "source": "security-advisories@github.com",
            "type": "Secondary"
          }
        ]
      }
    }
  }
}