{
  "gsd": {
    "metadata": {
      "exploitCode": "unknown",
      "remediation": "unknown",
      "reportConfidence": "confirmed",
      "type": "vulnerability"
    },
    "osvSchema": {
      "aliases": [
        "CVE-2024-29735"
      ],
      "id": "GSD-2024-29735",
      "modified": "2024-04-02T05:02:57.659124Z",
      "schema_version": "1.4.0"
    }
  },
  "namespaces": {
    "cve.org": {
      "CVE_data_meta": {
        "ASSIGNER": "cve@mitre.org",
        "ID": "CVE-2024-29735",
        "STATE": "RESERVED"
      },
      "data_format": "MITRE",
      "data_type": "CVE",
      "data_version": "4.0",
      "description": {
        "description_data": [
          {
            "lang": "eng",
            "value": "** RESERVED ** This candidate has been reserved by an organization or individual that will use it when announcing a new security problem. When the candidate has been publicized, the details for this candidate will be provided."
          }
        ]
      }
    },
    "nvd.nist.gov": {
      "cve": {
        "descriptions": [
          {
            "lang": "en",
            "value": "Improper Preservation of Permissions vulnerability in Apache Airflow.This issue affects Apache Airflow from 2.8.2 through 2.8.3.\n\nAirflow's local file task handler in Airflow incorrectly set permissions for all parent folders of log folder, in default configuration adding write access to Unix group of the folders. In the case Airflow is run with the root user (not recommended) it added group write permission to all folders up to the root of the filesystem.\n\nIf your log files are stored in the home directory, these permission changes might impact your ability to run SSH operations after your home directory becomes group-writeable.\n\nThis issue does not affect users who use or extend Airflow using Official Airflow Docker reference images ( https://hub.docker.com/r/apache/airflow/ ) - those images require to have group write permission set anyway.\n\nYou are affected only if you install Airflow using local installation / virtualenv or other Docker images, but the issue has no impact if docker containers are used as intended, i.e. where Airflow components do not share containers with other applications and users.\n\nAlso you should not be affected if your umask is 002 (group write enabled) - this is the default on many linux systems.\n\nRecommendation for users using Airflow outside of the containers:\n\n  *  if you are using root to run Airflow, change your Airflow user to use non-root\n  *  upgrade Apache Airflow to 2.8.4 or above\n  *  If you prefer not to upgrade, you can change the  https://airflow.apache.org/docs/apache-airflow/stable/configurations-ref.html#file-task-handler-new-folder-permissions  to 0o755 (original value 0o775).\n  *  if you already ran Airflow tasks before and your default umask is 022 (group write disabled) you should stop Airflow components, check permissions of AIRFLOW_HOME/logs in all your components and all parent directories of this directory and remove group write access for all the parent directories\n\n"
          },
          {
            "lang": "es",
            "value": "Vulnerabilidad de conservación inadecuada de permisos en Apache Airflow. Este problema afecta a Apache Airflow desde la versión 2.8.2 hasta la 2.8.3. El controlador de tareas de archivos locales de Airflow en Airflow configuró incorrectamente permisos para todas las carpetas principales de la carpeta de registro, en la configuración predeterminada agrega acceso de escritura al grupo de carpetas de Unix. En el caso de que Airflow se ejecute con el usuario root (no recomendado), agregó permiso de escritura grupal a todas las carpetas hasta la raíz del sistema de archivos. Si sus archivos de registro están almacenados en el directorio de inicio, estos cambios de permisos pueden afectar su capacidad para ejecutar operaciones SSH después de que su directorio de inicio se pueda escribir en grupo. Este problema no afecta a los usuarios que usan o amplían Airflow utilizando imágenes de referencia oficiales de Airflow Docker (https://hub.docker.com/r/apache/airflow/); de todos modos, esas imágenes requieren tener configurado el permiso de escritura grupal. Solo se verá afectado si instala Airflow usando la instalación local/virtualenv u otras imágenes de Docker, pero el problema no tiene ningún impacto si los contenedores de Docker se usan según lo previsto, es decir, cuando los componentes de Airflow no comparten contenedores con otras aplicaciones y usuarios. Además, no debería verse afectado si su umask es 002 (escritura en grupo habilitada); este es el valor predeterminado en muchos sistemas Linux. Recomendación para usuarios que usan Airflow fuera de los contenedores: * si está usando root para ejecutar Airflow, cambie su usuario de Airflow para usar no root * actualice Apache Airflow a 2.8.4 o superior * Si prefiere no actualizar, puede cambiar los https://airflow.apache.org/docs/apache-airflow/stable/configurations-ref.html#file-task-handler-new-folder-permissions a 0o755 (valor original 0o775). * si ya ejecutó tareas de Airflow antes y su umask predeterminada es 022 (escritura grupal deshabilitada), debe detener los componentes de Airflow, verificar los permisos de AIRFLOW_HOME/logs en todos sus componentes y todos los directorios principales de este directorio y eliminar el acceso de escritura grupal para todos los directorios principales"
          }
        ],
        "id": "CVE-2024-29735",
        "lastModified": "2024-03-27T12:29:41.530",
        "metrics": {},
        "published": "2024-03-26T17:15:47.380",
        "references": [
          {
            "source": "security@apache.org",
            "url": "https://github.com/apache/airflow/pull/37310"
          },
          {
            "source": "security@apache.org",
            "url": "https://lists.apache.org/thread/8khb1rtbznh100o325fb8xw5wjvtv536"
          }
        ],
        "sourceIdentifier": "security@apache.org",
        "vulnStatus": "Awaiting Analysis",
        "weaknesses": [
          {
            "description": [
              {
                "lang": "en",
                "value": "CWE-281"
              }
            ],
            "source": "security@apache.org",
            "type": "Primary"
          }
        ]
      }
    }
  }
}